[
  {
    "day": 89,
    "title": "What Are You Working On?",
    "content": "<p>Dear <<First Name>>,</p><p>As Muk gets much deeper and i really focus in on it. It allows us to have other time to talk about. So i'd love to hear what you are working on!</p><p>Reply wit h what your doing. I'll take 1 idea and break it down more.</p>"
  },
  {
    "day": 88,
    "title": "20 Daily Players: Building Muk to 10k MRR",
    "content": "<p>I'm kinda lost other than building this game. Not sure it's the most entertaining thing... But it will be a fun project to take to 10k MRR.... It's the only things ive been consistent with and I have a good \"starter\" group of about 20 people playing the game daily.</p><p>So that helps as well.</p><p>Would you play?</p><p>Muk.gg ?</p>"
  },
  {
    "day": 87,
    "title": "Muk: The 10k MRR Game Goal",
    "content": "<p>games are fun. But its hard to get into. I have posted on a few subreddit with people who love. No I just need to fix that and do well.</p><p>So that's why Muk is my first test. I wanna make it a 10k MRR game.</p><p>SO let's do that together?</p><p>Check it out and please let me know any feedback.</p>"
  },
  {
    "day": 86,
    "title": "How to Monetize Games: Skins and Micro Transactions",
    "content": "<p>How do you monetize a game?</p><p>Skins.</p><p>Micro transasctions make up so many sales its crazy.</p><p>Find a game that works and the micro transactions will be amazing. Look at what fornite has done. people buy vbucks to get cool skins and collect them all for all seasons.</p><p>That's my plan for muk. get the cool gear The crazy thing is you can make millions.</p><p>maybe i will one day.</p><p>ha</p>"
  },
  {
    "day": 85,
    "title": "Muk: An Idle Dungeon Crawler",
    "content": "<p>I think how can people build game likes fortnite because the amount of work that goes into that is insane. Yea sure you got a big team but those concepts and just style of play is so unique it takes off.</p><p>It reminds me of Amoung us that bascially blew up in a few months and it created full time salaries for the creators. Years later the game is still around and the people still run it.</p><p>That's my goal.</p><p>I'm not retiring from \"saas\" per say but i need a break. i've been a gamer all my life so it's fun to try and build something i would of wanted to play and see if others like the style.</p><p>I have been messing with concept for a game but i think the past 2 nights have been positive for me.</p><p>Muk is a idle dungeon crawler.</p><p>That i think you may like? let me know either way.</p><p>What are you working on? I'm off today. So get to spend it with my kids.</p>"
  },
  {
    "day": 84,
    "title": "6 Hours on Muk: Game Development Addiction",
    "content": "<p>i am addicted to making a game even though it may never make me money. Soooo iv worked out I it tonight for 6 hours. I revamped the entire game added good design and gonna see what happens. You see it at muk.gg but it's not a finished product. But we are getting there for sure</p>"
  },
  {
    "day": 83,
    "title": "Building Muk: My Own Text-Based RPG World",
    "content": "<p>I found my area I can focus on. is it gonna make lots of money? idk. But it's gonna be fun to build and simple.</p><p>I've always wanted to build like my own world and i've been digging into idle RPG's text based and there are very big followings for it... so why not try to make a following on that. It's simple, low overhead and with AI can make it really funn i'm sure.</p><p>So yea. I'm back to building Muk for the past few days. It's got the perfect domain name. Short and sweet. So it will be interesting to see what happens!</p><p>Please go play. Text based games done right are pretty addicting. People like how simple / complex they can become.</p><p>That's my goal.</p>"
  },
  {
    "day": 82,
    "title": "Games Aren't Going Anywhere: Build with AI",
    "content": "<p>Games aren't going anywhere. Anyone who says they are never played a video game before. They will only get \"better\" as time goes on.</p><p>Mobile games are also the hottest thing right now and little studios of 2-3 developers are making millions from these micro transactions etc.</p><p>What you need to do? Use AI to build yourself a simple game. You'd be surprised at how well it can do.</p><p>you will thank me later. i've been building out my idle rpg text game and i've never had more fun.</p><p>Did you know there are idle text games that get millions of people?</p><p>Be cool if Muk Got that. Yes if you have been here for awhile you know that wasn't the orginal game for Muk. But it's the most fun to build while I build out Trend Chart.</p>"
  },
  {
    "day": 81,
    "title": "Go After Big Players: Take Their Market Share",
    "content": "<p>Stop chasing simple ideas you see on social media. Go after the big players and make it better. You are able to take any big company. Break it down into smaller ideas that make it that much better for you.</p><p>What do i mean?</p><p>Take Canva for example. You can be building a simple image resizer, display etc. Are there tons of others out there. Of course. But none are doing it in the specifc way you want to do it. That's your advantage.</p><p>Build it in a way others will use it over the competition. Make it faster, less friction(no login etc), and slowly grow it. You don't need to convert millions of their users. You just need a few 100.</p><p>Hey if you get a decent market size of them or any of these businesses you could making 20k, 30k month.</p><p>Its why i'm building Trend Chart. It's basically what i do at my day job for the past 8+ years. The difference? Now there are only 3 big players and they all are focused on enterprise. My goal is simple.</p><p>Take some of their marketshares.</p><p>So what are you waiting for.... You need to take them also.</p><p>Built that idea now.</p>"
  },
  {
    "day": 80,
    "title": "The Simple Game Formula: Print Money",
    "content": "<p>The formula is simple.</p><p>Find a popular IOS game. Play it. Think about what is one feature you can change.</p><p>Build it with a different theme.</p><p>profit.</p><p>No yea that seems easy but it will take time but it's sure to print money.</p><p>Why? Game just make lots of money and no with AI you can easily generate something. Then start posting 1 video a day to social media about the game and wait.</p>"
  },
  {
    "day": 79,
    "title": "Target Rich People: The $20 Side Hustle Strategy",
    "content": "<p>I have pretty done every single side hustle there is. I followed the guru's bought the courses and all.</p><p>Nothing works. Most of them do well because they built the following and sold stuff to their following.</p><p>So how do you find something that really works?</p><p>Well you go after rich people....</p><p>Make a product for someone who has money. Not for your every day person.</p><p>I will say if you don't want to have lot of up front cost..... If you don't mind spending thousands on inventory etc then sure.</p><p>But if you want something you can start with $20 in your pocket. Find a niche that is very lucrative.</p><p>One of the best is to use public datasets. Which is what you need to do. Go to any of the public data bases. Find an area you like(or high ticket ones... just ask chatgpt). Download all the data - > build a site with codefast boilerplate - > lock the data behind a paywall - > share data in the dashboard with data linked to supabase or your database of choice - > make it look nice, add filters etc so it's way easier to read/study / download than the public database.</p><p>Profit.</p><p>Need more ideas ? Get access to proven ideas</p>"
  },
  {
    "day": 78,
    "title": "Automated LinkedIn Comment Tracker: A Proven Idea",
    "content": "<p>Hey so the idea is kinda smart. You can really use it on any social media channel. But the ones that have the best traffic Automated LinkedIn Comment tracker.</p><p>Why? People look track of their engagment on posts etc.</p><p>How would it work? AI tracks comments, flags opportunities, and suggests followups.</p><p>Its exactly how I build Proven Ideas.</p><p>Ideas are good but only when you actually have good ones. What do I mean by good ones? They have a popular market. Follow a popular framework.</p><p>I raised prices on Proven Ideas.... You should check it out before they get raised again.</p>"
  },
  {
    "day": 77,
    "title": "Back in the Database Game: Selling Shovels to Gold Miners",
    "content": "<p>I got another sale for my Proven Ideas database. It's kinda cool being back in the game of databases as I use to run a very successful one before I had to sell it due to life issues(if you are an OG you know).</p><p>That business made me 30k in under a year. I was charging $99/lifetime. It was a great product.</p><p>Now I have built Proven Ideas.... A better product than my previous one because now I find stuff that will work.</p><p>It's been fun making this along side my Paper Jets game(updated this game as well check it out!)</p><p>What's that old saying? Sell shovels to gold miners?</p><p>Anyway that's what I do. I hope you find the ideas and profit from it. Kinda crazy when you think about it.</p><p>What are you working on? you know we now have over 330 subscribers. Who read my rambles every single day.</p>"
  },
  {
    "day": 76,
    "title": "Medium Sucks: The Newsletter Writing Dilemma",
    "content": "<p>So look.</p><p>Im addicted to writing these newsletter but I sometimes don't know what to write about. I've been told many times that I should pick topic and go with it. But i can't my mind goes to fast. All i know is I enjoy dumping all my thoughts and ideas I have in an email everyday and hope that someone like you who reads it finds it useful.</p><p>So what we gonna talk about today... since I haven't been that good with the emails lately.</p><p>Well let's start with medium sucks.</p><p>not really... but like i posted everyday in November on a Varity of topics and only made $14.</p><p>When i can have one of you buy this and I make $100.</p><p>so was it worth it. I don't think so because i wrote all of October as well.</p><p>I will report back on this next month.</p><p>So dont write on medium? Maybe try x articles?</p>"
  },
  {
    "day": 75,
    "title": "Selling Proven Ideas: Focused on Paper Jets",
    "content": "<p>I'm addicted to build out my game therefore I'm selling it all. I listed proven ideas on Marc's trustmrr and got tons of hits. But as a subscriber of mine you get first dibs. I'm selling it on there for $300. But if you want proven ideas(with my vision behind it) you can have it for $150.</p><p>Just reply to this email.</p><p>And go play my game paperjets.io I improved a ton tonight into the morning</p>"
  },
  {
    "day": 74,
    "title": "Paper Jets Addiction: Season 1 Coming Soon",
    "content": "<p>I should be doing so much... but all i have focused on is Paper Jets. It's becoming a very addicting game that is gaining traction. I will eventually run ads or something but geez i'm having way to much fun.</p><p>You should really go try it and get good because Season 1 is coming very soon!</p>"
  },
  {
    "day": 73,
    "title": "Figuring It Out: Proven Ideas Evolution & Paper Jets",
    "content": "<p>Today we were suppose to setup our christmas tree. My twin boys had other plans....</p><p>So that didn't go well. But what did go well was I think i'm finally \"figuring it out\"</p><p>I have done two things today that will change the way i move forward.</p><p>I changed the way proven ideas works. Not only will I find proven ideas from billion dollar companies etc... I will be monitoring subreddits, x, quora, linked in etc for comments, posts, ideas and compile them into the database when I see fit(this means seeing a topic 2-3 times before we add it making sure this is a valid idea people are \"searching for\"</p><p>I REALLY love making a game. I also found out you can build mini apps in Telegram. So that's what I did. I also vastly improved the Flappy Paper design/website.</p><p>I'm excited as always. I'd love to you try Paper Jets</p>"
  },
  {
    "day": 72,
    "title": "5 Hours Building: Proven Ideas Database Update",
    "content": "<p>I spent 5 hours building out the proven idea database with tons of more information. I'm excited to share it with you in the coming days. We got so many ideas!!! That can make you money.</p><p>Get access before price jumps proven ideas</p>"
  },
  {
    "day": 71,
    "title": "Back to Databases: Abandoned-Checkout Recovery",
    "content": "<p>Here is day 71 @latest I finally found my new product to work on. If you know me, you know I did pretty well with idea databases. But the problem with them was I never really knew what to do with them. I didn't see a purpose but looking back there is a big market for it.</p><p>So i'm back.... but this time i'm not reworking something, starting over or anything in that nature. I am just taking the momemnt of silence.</p><p>So what's the idea? Well this is pulled directly from Proven Ideas Database.</p><p>- Abandoned-checkout recovery - You can use it to track down drop offs, send automated emails/follow ups allowing you to show recovered revenue in real time. A stat that medium to large size companies would use and pay for.</p><p>Get more ideas like this with way more detail. Currently Proven Ideas is 70% off but this won't last long.</p><p>Get Access now</p>"
  },
  {
    "day": 70,
    "title": "I'm back to building what started this all. Databases",
    "content": "<p>I'm back to building what started this all. Databases</p><p>My newest one is called proven ideas</p><p>Where I research billion dollar companies and find the hidden features you can build in them.</p><p>I got lots of work to do with it because there are 1,000's of companies.</p><p>You can grab lifetime for 70% for Black Friday.</p><p>Check it out proven ideas</p>"
  },
  {
    "day": 69,
    "title": "The game is improving",
    "content": "<p>The game is improving I was so hooked on it I went to sleep without writing my first draft of this newsletter! So we aren't sending this at 6am!</p><p>We are sending it at 830. Which is fine. You can play the game at flappypaper.com</p>"
  },
  {
    "day": 68,
    "title": "I don't know what to make anymore.",
    "content": "<p>I don't know what to make anymore. I'm lost. The retirement planning tool was a good idea but I'm just not into it. I don't get excited to work on it. So I cut it off quick. I didn't learn my lesson though as I still bought the domain for both the muk game and the planning idea.</p><p>The muk game was too boring for me. I didn't feel excited when playing with it. Plus the name sucked.</p><p>WTF is muk... waste of $50 for the domain... and I couldn't decide on the game.</p><p>I made another game that I think is way more addicting...</p><p>Flappy Paper.</p><p>It's a play on Flappy Birds & Paper Airplanes.</p><p>You can add your high score and rank on the leaderboard.</p><p>Reply with what you think!</p>"
  },
  {
    "day": 67,
    "title": "Happy 6 7 to those who celebrate!",
    "content": "<p>Now my kids say it. So this issue is dedicated to that.</p><p>Where did this trend even happen.</p>"
  },
  {
    "day": 66,
    "title": "We are live.",
    "content": "<p>I'm not gonna mess with it other than say. We are live.</p><p>Come check us out and get the best discount to start. It won't ever be this cheap again. So if you think you may use it one day. I suggest you buy now!</p><p>Thanks for reading my stuff every day. Here's the link <a href=\"#\">click here</a></p>"
  },
  {
    "day": 65,
    "title": "Sometimes you just gotta know how your body is feeling.",
    "content": "<p>I really wanted to finish money map yesterday and share it in this newsletter issue today but it really wasn't gonna happen with how tired I was.</p><p>The kids went to sleep so I got an early start but by 10 I was exhausted. So I'm hoping I'll have it done this weekend!</p><p>A financial planning tool unlike any other. Excited for you to see it and happy to finally work on it.</p><p>What are you building? Share it with me I may put it in a issue</p>"
  },
  {
    "day": 64,
    "title": "Sometimes you just gotta know how your body is feeling.",
    "content": "<p>I really wanted to finish money map yesterday and share it in this newsletter issue today but it really wasn't gonna happen with how tired I was.</p><p>The kids went to sleep so I got an early start but by 10 I was exhausted. So I'm hoping I'll have it done this weekend!</p><p>A financial planning tool unlike any other. Excited for you to see it and happy to finally work on it.</p><p>What are you building? Share it with me I may put it in a issue</p>"
  },
  {
    "day": 63,
    "title": "Happy Hump Day!",
    "content": "<p>Another day, another idea/product.</p><p>I finally bit the bullet and made a finance app. But not like other ones you see. I am going to make something a little different. Something simple that you can map out your life without spending hours building out data.</p><p>It's gonna be fun to build and make finances come to life. Look forward to sharing it with you over the next few days!</p>"
  },
  {
    "day": 62,
    "title": "Happy Hump Day!",
    "content": "<p>Another day, another idea/product.</p><p>I finally bit the bullet and made a finance app. But not like other ones you see. I am going to make something a little different. Something simple that you can map out your life without spending hours building out data.</p><p>It's gonna be fun to build and make finances come to life. Look forward to sharing it with you over the next few days!</p>"
  },
  {
    "day": 61,
    "title": "The Hook Matters",
    "content": "<p>No, I didn’t send this on the wrong day. I know it’s Tuesday. The whole point of the subject line was to make you open this email.</p><p>And you did.</p><p>That’s today’s lesson. I love studying subject lines and understanding what people actually click on. Headlines matter more than most people think.</p><p>It’s the same reason news headlines are always so catchy. They’re written to pull you in—even if the story has nothing to do with your interests, you still read it because the headline grabbed you.</p><p>That’s what I try to do with everything I make. And you should too.</p><p>Bring the user in. Keep them around. Guide their attention.</p><p>This applies anywhere you post. The hook is the most important part. If you can’t get someone to stop scrolling and follow you for a moment, you can’t do much else.</p><p>So work on your hook. Work on getting eyeballs on your stuff. Share every day. Stay visible.</p><p>If you do that, you’ll eventually see success.</p>"
  },
  {
    "day": 60,
    "title": "Sixty Days Straight",
    "content": "<p>Sixty days is a long time. That’s basically two months—and for two months I’ve shown up and written every single day.</p><p>Yeah, it only takes me about 20 minutes, but I think I’m onto something. A lot of people have suggested I pick one topic and stick to it, but I’m not ready for that yet. Right now, I’m loving building this game. We’ve improved it a ton.</p><p><strong>Muk</strong> is the future for now… but maybe not forever.</p><p>All I’m really trying to do is make money and share what works, what doesn’t, and why.</p><p>So I’m starting fresh with this new idea, and it’ll be fun to see where the game is in a year.</p><p>I still have a lot to add, and the real test will be when I start making clips for it. I think this style of game could do well with UGC content. The issue is I’m not ready for that push yet. If the game isn’t decent, people won’t stick. I need enough content for players to actually stay.</p><p>That’s why you always need more than enough for people. It doesn’t need to be finished—but it needs to feel close.</p><p>Also… I’m starting a new diet tomorrow. I’ve let myself go over the past few years and I’m up 100 pounds. I’m 6'6\" and weigh 380 pounds right now. It’s bad, but I used to be 430, so I’m down 50.</p><p>Maybe sharing it here will help me stick with it this time. I might even give a weekly update—partly for you, mostly for me.</p><p>Because just like this newsletter, I need to hold myself accountable. Are you doing the same?</p><p>Reply to this email with any questions, and let me know what you think of the game!</p>"
  },
  
  {
    "day": 59,
    "title": "Building Again",
    "content": "<p>I haven’t been this excited in a long time. You know why? Because I love building. And that’s exactly what I’m doing again while still writing this daily newsletter.</p><p>I wanted to make a game—so I made one. With AI, building is faster than ever.</p><p>How am I doing it?</p><p>I’m using Cursor to build everything and ChatGPT to generate the SVG sprites.</p><p>The game is called <strong>Muk</strong>, and you can try it right now.</p><p>I’ve got big plans for it. The main model in gaming is simple: skins, coins, upgrades. So I’m going to introduce those and see what happens…</p><p>What are you working on?</p>"
  },
  {
    "day": 58,
    "title": "Meet Muk",
    "content": "<p>Okay, so I’m enjoying building this game way too much. I kinda went ham tonight. It’s 3 a.m. while I’m writing this, and the game looks completely different now.</p><p>The new name is <strong>Muk</strong>, and I snagged a killer domain: <strong>muk.gg</strong>.</p><p>So that’s it. I’m committed. I’m focusing on this and seeing how far I can take it.</p><p>Why is it different? Because it’s a browser game that uses almost no memory and works on every device.</p><p>Desktop? Go ahead.<br>Tablet? Go ahead.<br>Phone? Go ahead.<br>The game adjusts to all of them.</p><p>You can try it here.</p><p>I’m still building out the basics, but there will be levels, skins, and a way to save progress so you can log in from any device and pick up where you left off.</p><p>Let me know what you think in the replies or hit me up on X!</p><p>Now enjoy your day—and don’t play Muk too long!</p>"
  },  
  
  {
    "day": 57,
    "title": "I Built a Game",
    "content": "<p>I’ve always been a gamer, and with how easy AI makes things now, you’d think I would’ve built something sooner. But I never did. Life happened, work happened, and gaming slowly slipped away.</p><p>But lately, I’ve missed it. So I finally made something I would actually enjoy playing—a simple, endless shooter where you play as a blob.</p><p>Yep. You’re a blob taking on a whole lot of enemies.</p><p>It’s free, and it’s mobile-ready.</p><p>The name: <strong>Blobbi</strong>.</p><p>You can try the game here.</p><p>If that link doesn’t work, try this one.</p><p>I’d love to know what you think. What should I improve next?</p><p>Until tomorrow!</p>"
  },
  
  {
    "day": 56,
    "title": "One Hour of Writing",
    "content": "<p>I don’t know whether to feel happy or sad about this one. An hour is a long time to write nonstop, and I recorded the entire thing. It’s wild how many times I almost fell asleep mid-sentence—probably because I haven’t slept much these past two days with the kids being sick.</p><p>But honestly, it was fun. I got a lot out of it, and in my usual fashion, I’ll take everything I wrote and turn it into content—flywheels, articles, whatever makes sense.</p><p>One hour is tough. I think doing this in 20-minute blocks tied to a specific idea would be easier. Just typing until I run out of steam is… a challenge.</p><p>Still, I ended up with a solid blog post after a few prompts from ChatGPT.</p><p>You can read the final story on my site, and I uploaded the full hour of writing to YouTube if you want to watch the whole thing. I even posted the full transcript.</p><p>This was fun, and I’m definitely doing it again.</p><p>I recommend you try it too—just maybe not exactly how I did it. Focus on ideas you have angles for. There’s always something there. You just have to start.</p><p>I’m here to prove that if you keep doing something consistently, something eventually happens. Imagine writing that many words every day for months, years, decades… it would change everything.</p><p>So what am I saying? Just start. Build the best thing you can with the time you have.</p>"
  },
  {
    "day": 55,
    "title": "Focus Is the Real Flex",
    "content": "<p>I almost bought a new domain today…</p><p>If you know me, that shouldn’t surprise you. Less than six months ago, I owned over 150 domains. I ended up selling them all just to make ends meet.</p><p>Out of those 150, around 120 had live sites. Most were simple one-pagers for backlinks and small bursts of traffic. Others were real projects with real audiences.</p><p>But here’s the truth: how do you handle 110 live sites? What if even one of them went viral? I couldn’t have kept up. In hindsight, selling everything was a blessing.</p><p>Now I’ve got just one: MattMerrick dot com. The greatest website since The Useless Web.</p><p>So yeah… I was about to buy another domain and start another project, but I didn’t.</p><p>I promised myself I’d focus on this one site and this newsletter for at least a year. I’m already planning to go longer. The whole point was to force myself to focus.</p><p>You need focus too. Maybe not exactly like me, but if you want to get ahead, you have to carve out time for what actually matters.</p><p>For me, that means no more siloed projects. If I build anything, it lives on my domain. Nowhere else.</p><p>I wish I were as creative as Neal Fun. But honestly, the best thing I’ve ever created is this journey I’m documenting in real time.</p><p>Anyway—talk tomorrow. How many domains do you own?</p>"
  },
  {
    "day": 54,
    "title": "The Truth About ‘Starting From Nothing’",
    "content": "<p>I often wonder what really makes someone successful. How did they actually get there?</p><p>Most of the time, the people you see winning had help—real help. And there’s nothing wrong with that. It’s just interesting to notice.</p><p>You know the stories: “We started building this, and instead of taking VC money, we asked friends and family and raised $100k.”</p><p>$100k?<br>Holy shit.</p><p>I grew up middle class, but I never had friends or family who could pull together that kind of cash. And I’m not mad at anyone for having that advantage. They still had to execute. They still had to build something real.</p><p>But it hits you a little differently. You think, “I can do this,” and then you learn they had a six-figure head start.</p><p>$100k gets you marketing. It gets you a teammate. It buys you time. It even gets you a meeting with someone who changes everything.</p><p>So I’m always hesitant when someone says, “I started from nothing.” Sure—they started at zero. But three months later, they scaled with a friends-and-family raise that most people never have access to.</p><p>What am I really trying to say? In the end, the advantage that matters most isn’t money—it’s marketing. If you can market better, faster, and smarter than your competition… you win.</p>"
  },
  
  {
    "day": 53,
    "title": "Don't Quit—Pivot",
    "content": "<p>Some days you don’t want to keep going. You want to pause for a day or a week and promise yourself you’ll pick it back up later.</p><p>The problem is, when you actually stop, coming back gets harder. Maybe you’re different—personally, I’m not. When I pause, momentum dies.</p><p>Tonight was the first night I didn’t know what I wanted to write about. Not because I ran out of ideas, but because I wasn’t sure which idea mattered today.</p><p>Everyone works differently, and I’m no exception. But here’s one thing I’ve learned: if you don’t speak up, if you don’t share what’s going on, two things happen—people don’t get to know you, and you don’t grow yourself.</p><p>Humans crave connection. That’s why so many solopreneurs burn out. The social side disappears. Even people earning serious money feel it—they’re spending ten hours a day fixing bugs, shipping features, competing with companies far bigger than them.</p><p>I’ve been there… and not even at a high level. It stressed me out. Writing this newsletter feels different. It’s organic. It’s honest. It’s me learning in real time. I don’t feel like quitting, because I finally found my lane.</p><p>You don’t need to be the biggest player to make the money you want. You just need to stay consistent and keep showing up.</p><p>This week I gained 28 subscribers—four per day. I’m completely fine with that because one day, I know it’ll be 28 per hour. It might take years. I’m not stopping.</p><p>So if you feel like quitting, maybe you don’t need to quit—you need to pivot. Even if you shut down your current business, you can redirect that energy into something new.</p><p>The people who adapt survive. AI is here. Learn it. Pivot with it. Keep moving.</p>"
  },  
  {
    "day": 52,
    "title": "Find Your Water",
    "content": "<p>Everyone drinks water. Everyone needs it to survive.</p><p>But depending on where you live, the way you get it is different.</p><p>In the U.S., you buy bottles of it.</p><p>In other countries, people look for wells with safe drinking water.</p><p>The same goes for business. You have to understand your users. If you assume you already know everything, you’ll fall behind.</p><p>Water is the most important thing we have as humans, yet everyone has a different thought when they hear it.</p><p>Only in America can you think to charge for it. I’m sure it happens elsewhere, but still—it’s wild.</p><p>My point? Find an area you want to target. Obsess over it. Find your water.</p>"
  },
  {
    "day": 51,
    "title": "Start Something — It Adds Up Fast",
    "content": "<p>The twins have T-Ball this morning and it got me thinking. How lucrative are these kinds of businesses?</p><p>It costs us $350 for the season because we have two kids. The season lasts eight weeks, one hour per week.</p><p>That’s $18.75 per session per child. There are 20 kids in the class, which means $375 per session in total.</p><p>The owner has two helpers running it. Let’s say he pays them $25 each per hour. That’s $50 in labor.</p><p>$325 profit per session for eight weeks. Not bad.</p><p>This doesn’t include gym costs or insurance, but even if you cut that in half, it’s still solid money for watching three-year-olds run around bases and try to catch a ball.</p><p>It’s proof you should start something. You’d be surprised how fast it adds up.</p><p>It can be local, online, or both. It doesn’t matter. The key is to start.</p><p>Need help finding ideas? Reply to this email and say hi. I’ll help you find that million-dollar idea.</p><p>You got this.</p><p>Share this with a friend. If you are that friend, follow this link to sign up.</p>"
  },  
  {
    "day": 50,
    "title": "You Don’t Make 18K in 5 Days by Luck",
    "content": "<p>You don't make $18,000 in five days by luck.</p><p>It happens over time, with hours of work, patience, and the right product.</p><p>If you’ve been online, you’ve heard of Marc. I started following him two years ago. That’s when I began taking my own SaaS building seriously.</p><p>He launched a product called <strong>ShipFast</strong>. It handled the details so you could focus on shipping. The launch went viral. That was his first big hit.</p><p>That was almost two years ago. Since then, he’s built solid products like <strong>DataFast</strong>, which I think will become a million-dollar MRR business.</p><p>He also launched <strong>CodeFast</strong>, which I’ve shared before. If you’re a developer or just starting out, it’s worth checking out. You even get ShipFast included.</p><p>Now Marc is making real money. But he’s still a builder first. He saw a tweet from Pieter Levels and got an idea.</p><p>Twenty-four hours later, he built it, shipped it, and it worked.</p>"
  },
  {
    "day": 49,
    "title": "18,380 MRR in 5 Days — You Don’t Make 18K by Luck",
    "content": "<p>You don't make $18,000 in five days by luck.</p><p>It happens over time, with hours of dedication, determination, and the right product.</p><p>If you aren’t living under a rock, you’ve heard of Marc. I started following him two years ago, and that’s when I began taking my own SaaS building seriously.</p><p>He launched a product called <strong>ShipFast</strong>. It handled the setup so you could focus on shipping. It went viral. His first real hit.</p><p>That was almost two years ago. Since then, he’s launched other strong products like <strong>DataFast</strong>, which I think could reach a million MRR, and <strong>CodeFast</strong>, which I’ve shared before. If you’re a developer or just starting out, it’s the course for you—and ShipFast is included.</p><p>Now he’s making serious money. But he’s still a builder first. He saw a tweet from Pieter Levels, had an idea, built it in twenty-four hours, launched it, and it worked.</p><p>None of this happened overnight. He spent years refining his niche, his audience, and his skills for moments like that. He could move fast because he recognized the opportunity and was ready.</p><p>Here’s what I’ve learned after forty-nine days of writing:</p><p><strong>You have to put the work in.</strong> It might not make sense now, but one day it all clicks—and usually on something you didn’t expect.</p><p>Don’t give up. You got this. Start today, and soon you can be like Marc.</p><p><em>P.S. Go read the Medium article I published on this for free, and remember you can support me by subscribing.</em></p>"
  },
  {
    "day": 48,
    "title": "Writing at 3 AM — Why I Really Want to Be Rich",
    "content": "<p>I almost missed writing this one today, but not for a reason other than my kids being sick.</p><p>If you don’t know, I have twin boys and a daughter—all three under the age of three. And man, when one gets sick, it feels like they all get sick.</p><p>And guess what... they all have ear infections. So all night I’ve been laying near them, making sure they sleep okay.</p><p>When I was thinking about what to write, I planned to talk about how excited I am to publish all my new articles tonight and start my progress on a new idea.</p><p>My goal was simple: one newsletter issue, one Medium article, and one blog post a night.</p><p>But tonight, I can only do this newsletter issue. It’s actually 3 AM—I fell asleep next to them because I was so tired.</p><p>Still, I learned something important today. I want to be rich—not for fancy cars, big houses, or trips around the world—but for days like today, when I’m gone all day and can only get updates from my wife about how they’re feeling.</p><p>This newsletter will get me there one day. We’re still early—only forty-eight days in—but the goal is to write this and only this every single day. It might never happen, but I wouldn’t be happy with myself if I didn’t try.</p><p>And honestly, I love talking to you. You’ve become my friend because you read my thoughts and keep coming back. I appreciate that.</p><p>I recently opened a monthly subscription where you can support me. It changes nothing—I’ll still send these for free. But maybe if I get over twenty subscribers, I’ll start sending a weekly email with ideas for good side projects and things I’ve learned.</p><p>You never know what tomorrow brings, so live life in the moment. Start that business. Reach out to that old friend. Life’s too short to wait around.</p><p>Build something with AI—it’s never been easier.</p>"
  },
  {
    "day": 47,
    "title": "First Paid Subscriber — Why Focus Matters",
    "content": "<p>That’s how much I’ve now made from this newsletter.</p><p>When you think about it in the scheme of life, it’s nothing. I can’t even get a Starbucks coffee where I’m from (maybe a small hot coffee or whatever they call small coffees).</p><p>But the point is, it’s validation that what I’m doing here matters to at least one person enough to take out their wallet and support me.</p><p>That’s kind of crazy.</p><p>My subscribers get nothing at the moment other than making this newsletter ad-free forever and just my thoughts—which I’m gonna do for free anyway because I love it.</p><p>But here’s the thing: building something isn’t easy. I’ve been trying for years.</p><p>There’s always an argument on X about whether you should focus on one idea or do many.</p><p>The answer depends on you.</p><p>For me, I was doing multiple things with the limited time I had, and honestly, looking back, that was probably an issue.</p><p>I only do this in my free time. After my kids go to bed around 9:30, I log on and work on whatever product, newsletter, or idea I had at the time until I can’t keep my eyes open anymore. Every single night for the past two years—I think I only missed one day because we had a wedding to go to and I got home too late.</p><p>In these past two years, I’ve built and sold three newsletters and hundreds of websites, from simple calculator sites to the one I made $30k from.</p><p>But what if I focused on only one thing? I think I would be way better off.</p><p>So… for the past forty-seven days, I’ve only focused on this newsletter. I’ve gotten my first paid subscriber and now have over 200 awesome people reading it.</p><p>I have no plan of stopping, and honestly, why would I? For me, focusing on one thing is how I can succeed. It just took me all these years to realize it. Now I know that if I focus, good things can happen… I hope.</p>"
  },
  {
    "day": 46,
    "title": "A New Month — The Work Starts Now",
    "content": "<p>It's a new month. It's a new week.</p><p>Get at it. The time is now. You need to push forward. I’m here to help you.</p><p>The thing is… 90% of people won’t start, and 95% of those who do won’t continue after doing it once or twice.</p><p>Those are crazy stats—and you need to break them.</p><p>Don’t go crazy. Do what I do. I spend one hour a day writing this newsletter, posting to X, and writing a Medium article.</p><p>It doesn’t matter when I do it, only that I do it. And now I’m taking it one step further.</p><p>To make this content even better, I’ve decided against sponsorships and ads at the top of the newsletter.</p><p>Instead, you can subscribe for $5/month to support me in keeping this ad-free—only if you wish.</p><p>This newsletter will still be sent every single day, for free.</p><p>I’ve had a few people ask about buying ad spots, but I really like how pure each email is—no bias, just my thoughts. So I want to keep it like that.</p><p>For $5, you get 30 or 31 issues depending on the month. And I can promise you, I’m just getting started.</p><p>I have no signs of stopping, and that $5/month will get you more in the future when I add new perks or ask the community what they want.</p><p>Either way, you can support me now if you wish—but all I ever ask is that you share this with a friend.</p><p>Now, Marc didn’t get this overnight. He spent years perfecting his niche, audience, and skills for moments like these. He was able to produce and market quickly because he saw an opportunity.</p><p>If there’s anything I’ve learned over these past forty-six days of writing, it’s this:</p><p><strong>You have to put the work in.</strong> It might not make sense right now, but one day it all just clicks—and most likely on something you didn’t expect.</p><p>Don’t give up. You got this. Start today, and soon you can be like Marc.</p><p><em>P.S. Go read the Medium article I published on this for free, and remember you can support me by subscribing.</em></p>"
  },
  {
    "day": 45,
    "title": "Push Through the Burnout — Marketing Matters",
    "content": "<p>I'm tired, but not in the sense you might think.</p><p>You see, I have been doing side hustles for many years, and one thing always happened: I get burnt out or bored with the idea, then move on.</p><p>I mentioned this in a previous issue, but it’s such a big thing for me I’d like to re-explain it.</p><p>I get tired of doing the same thing over and over again, and honestly, most people do.</p><p>But as I said yesterday, this is where legends are made.</p><p>If you are tired, you have that much more reason to push through.</p><p>My normal routine:</p><ul><li>Find a killer idea</li><li>Build a Micro SaaS for it</li><li>Sell it (one-time fee, but it can be anything)</li><li>Market it</li></ul><p>The marketing is when I get bored and feel done—not sure what to write, not sure what meme will pop off.</p><p>Most people do this now, and with AI, it’s even faster to get to MVP.</p><p>Let me say this: you don’t need a big following. Even my X account only has 6k users.</p><p>What you need is a niche you want to talk about. When I ran Niche Tools (I sold it to make ends meet), I used to do a series.</p><p>It was good because it did three things well:</p><ul><li>It was in my niche (Niche Tools was a database of free tools you could build)</li><li>Engagement — to see the site, users had to engage with the post</li><li>Lots of sales</li></ul><p>It worked. It got people to comment. I would DM the link of the site, share it, and get anywhere from 2-5 signups each time. I sent it three times a week.</p><p>That was my only marketing.</p><p>So when you build something, make sure you are always marketing. I found something that worked and repeated it in a different format, which allowed me to grow that database tremendously.</p><p>So what am I trying to say?</p><p>It's simple: don’t stop trying. If you fail, it’s ok—there will be another opportunity. And find a good marketing strategy. Test everything.</p><p>You are a seller. You need to get the user to buy. The only way to do that is to market. Keep going.</p>"
  },
  {
    "day": 44,
    "title": "Keep Going — You’re Closer Than You Think",
    "content": "<p>I won.</p><p>Everyone has something they’ll never forget. My kids being born tops the list.</p><p>So I won at that game.</p><p>But nothing else really. You see, I’ve struggled over the years chasing the next big thing—dropshipping, print-on-demand, AI—you name it. I’ve done it all, only to lose money or make very little in the grand scheme of things.</p><p>Building something is hard. Getting users is even harder. I’m not going to sit here and tell you I’ve got all the answers, but I can say this:</p><p><strong>Keep going.</strong></p><p>99% of people quit. They do it for a week and stop.</p><p>Why do you think gyms always have discounts at the start of the year? It’s free money. According to one article, around $350 million is made from unused gym memberships (I didn’t validate the source, so take it lightly).</p><p>Even if it’s half that—$175 million—that’s still a lot of money from people not even using the product.</p><p>Now imagine if you worked on your idea, product, or social media account for that same amount of time.</p><p>I guarantee you’d make money from it.</p><p>There’s a great study that says people need to see something seven times before they buy.</p><p>Find an idea you don’t mind working on. Give it a year. See what happens.</p><p>Don’t give up. Because it’s true—good marketing beats a good product.</p><p>The people who make it are the ones who show up each day.</p><p>Today can change your life. So work on today and forget about tomorrow.</p><p><em>P.S. No, I don’t have something to sell you. But you can forward this issue to a friend—and if you are that friend, you can sign up here.</em></p>"
  },
  
  
  {
    "day": 43,
    "title": "Happy Halloween! & Growth Update",
    "content": "<p>Happy Halloween! If you don't celebrate, that's ok. I'll make sure my kids get you lots of candy.</p><p>This year the twins (who are 3 1/2) wanted to be a ghost... So they are gonna be ghosts. My daughter (who is 2) is gonna be a witch!</p><p>So I'm excited for the afternoon. But I still have to go into the office today. So that stinks.</p><p>This is why I wish I had my own business but it's hard to make it successful, and that's why I have a 9-5. But focus is important.</p><p>I have been writing this now for 43 days and I'm not gonna sit here and say I have over 10k subscribers... I don't.</p><p>But I have seen the numbers go up dramatically over the past few weeks. Now I am getting a crazy week-over-week growth and because I can track it all, it will be cool to see what happens with it. In just the last 7 days alone, I've gained 30+ subs. Two weeks ago, I wasn't even gaining that much in a week.</p><p>So while I'm trick or treating I'm gonna make sure I tell everyone about my newsletter because why not it's free marketing.</p><p>There are so many things you can start a career in. It's time you start looking and be your own boss.</p><p>reply and tell me what you think of making?</p>"
  },
  {
    "day": 42,
    "title": "I almost died today..... & The 'Do It' Mindset",
    "content": "<p>I almost died today..... So I take the Citi Bike to one of our offices once a week, and man people are crazy on the streets of New York.</p><p>It's like crazy even with the bike lanes, people are wild.</p><p>I was flying on 5th avenue when a red light came up, and this mfer went through the red light, almost hitting me.</p><p>Thankfully, I saw him coming and didn't think he was gonna stop so I turned down the side block even though it wasn't the way I was gonna go. I was using the ebikes and they are fast so no way I could of stopped.</p><p>Then I went up on the curb, almost lost my balance, but thanks to me being amazing (it was pure luck), I was able to stabilize the bike.</p><p>I couldn't stop thinking about it all day, and even now when I'm writing this issue for you to read bright and early.</p><p>Look... We only live one life.</p><p>Talk to that person you have a crush on, start your micro saas, learn to code, build a newsletter, become a social media expert, and go viral on TikTok.</p><p>The point is to do it because we aren't promised tomorrow. I know that saying is popular, but it's really true.</p><p>What is stopping you from doing what you wanna do? The answer should be nothing. There is always time in the day to do stuff. One of my biggest pet peeves is that I didn't have the time. You didn't have the time to write for 5 minutes? Read a book or an article instead of a TikTok video?</p><p><strong>Don't make excuses... do it.</strong></p><p>Need help?</p><p>Reply to this email. I only got two responses over the past few days... I thought we were friends.</p>"
  },
  {
    "day": 41,
    "title": "My Basketball Number and Life's True Value",
    "content": "<p>Number 41... That was my basketball number. It's what I've played my entire life. Basketball taught me a lot, and I'm grateful for it. I learned how to be a team player, how to go through life always busy and so much more.</p><p>It's a great memory I have now in my old age. It makes you think and say Was it worth it. All those hours \"wasted\" going to the gym late at night, getting up jump shots, and hitting the weight room to work on my foot speed. I don't regret any of it and I think it shaped me to be who I am today....</p><p>a broke 37-year-old who doesn't know what to do with his life, can't keep a job, and had to sell everything to keep his family afloat.</p><p>So yeah basketball taught me a lot... haha</p><p>But in all seriousness.... I do not regret playing and I loved every second of it. Now I am older and all I wanna do is teach my kids how to play.</p><p>Some things come into your life that you just know is a benefit for you. You find your spouse, you start that new job, you get your d-1 scholarship for sports, and you build a Micro SaaS that does 10k MRR.</p><p>It doesn't matter what it is, everything in life creates who you are. So next time you are thinking... what is this gonna do for me take a second and reflect on that. Maybe in that moment you don't see it working out, but who knows when the time will come to meet and be around someone smarter than me.</p><p>Keep building, Keep going. you got this. Remember I wasn't always good at basketball... I worked at it. Yea I had the height and some skills but I worked on my craft. You need to do the same. It's the same thing I'm doing with this writing. Write every day and see what happens.</p><p>Just remember... you gotta try to see results.</p>"
  },
  {
    "day": 40,
    "title": "40 Days In: Love for Writing vs. Money",
    "content": "<p>I plan to never stop writing this newsletter. It will be a way for you to know I've died if they stop sending. I am on day 40 and with 19,345 left to go till my 90th birthday. I have no plans of stopping!</p><p>Haha, that's crazy to think about, but really, I just love writing these. but.. I'm not making any money. So it's like a double-edged sword. I could of built 10 different micro saas's and been making some money, but I chose this.</p><p>That's ok. I don't regret it... the thing is, you always wanna do something you enjoy. I know some of you will argue and say But money is what drives me. I get that, but the majority of people who got \"rich\" got mega-rich in a year? very little. People accumulate wealth over time.</p><p>The ship fast mindset works but you have to do it a bit differently. Build out little businesses like Marc did and over time they will compound.</p><p>He didn't make 100k on his first product. But he did make it on CodeFast. But that was years in the making.</p><p>So what I'm saying is... <strong>start today... Build now</strong> and don't let everyday consume you.</p><p>Do a structure that works for you. I had to stop posting to EVERY social media because it was to much.</p><p>So now I just post to X, LinkedIn, Medium, and Threads a day, with 2-3 times a week I try to make it a video. It works for me. My LinkedIn game can improve. Whenever I get enough money saved up, I'll buy Justin Welsh's LinkedIn Course.</p><p>When they say do something you love because it will never feel like working... Is true. But the reality is even fewer will be able to be paid a full-time salary for what they do. If you do... then hold on to it. its precious.</p><p>How was your Monday? Do anything fun? Hopefully, you're working on your side projects a little. Would love to hear about them. Hit that reply button. I respond to everyone... no one has replied in a few days so I'm sad I got no one to talk to!</p><p>Also, if anyone wants to sponsor this newsletter. Feel free to reach out. It's $10/issue and you can book 1 month in advanced (since I'm writing everyday). I also will give discounts for multiple ad spots. Nothing fancy it will be in this section as a P.S - > Like you always see me do. But since you will be one of the first sponsors I'll share it to my 6k followers on X as well and my medium article. So really the first few people will get tons of exposure. I need $200 to pay a bill. So once I hit that amount, I will close ad spots down again.</p><p>Ok bye.</p>"
  },
  {
    "day": 39,
    "title": "The Idea: Why You Need to Start Today (ChatGPT Prompt)",
    "content": "<p>I got an idea. You should start doing something. Whatever it is just start today. Read the rest of this email. Stop what your doing and do it.</p><p>You know why?</p><p>Because it's been 39 days of writing this and I've learned one thing. <strong>You can't stop.</strong> This week alone I've gained 38 subscribers! That's insane when you think about it. As of writing this we are almost at 140 subscribers. I started writing this newsletter 39 days ago and now I'm like let's go.</p><p>So now you want the ideas. It really depends what you are looking for.</p><p>I'm big on the ebooks right now and they are easy to maintain. Write something once and sell for $3-$9 and get some income. But those aren't gonna make you \"rich\".</p><p>The quickest way to achieve fast growth is by building a SaaS. In the latest trend doing it better than everyone else. OR Find a billion-dollar business from this chatGPT prompt then take that and do it better than the rest. Make it a single focus and work your butt off.</p><p><strong>Prompt:</strong><br/>\"I want you to act like a startup strategist and idea distiller.<br/>Your job is to help me uncover a business idea inspired by a billion-dollar company, but adapted to my unique skills, interests, and access.<br/>Steps:<br/>* Ask me 5–7 questions about my background, interests, industry knowledge, and daily frustrations.<br/>* Then analyze billion-dollar companies or unicorns with similar business models or audiences.<br/>* Find a pattern, but help me shrink it down into something I could realistically start as a one-person business or small team.<br/>* Deliver 3 clear ideas — each should include:<br/>&nbsp;&nbsp;&nbsp;&nbsp;* The inspiration company (e.g., Airbnb, Notion, Stripe, Duolingo, Canva, etc.)<br/>&nbsp;&nbsp;&nbsp;&nbsp;* The simplified or niche version I could start<br/>&nbsp;&nbsp;&nbsp;&nbsp;* Why it fits my personal unfair advantage<br/>&nbsp;&nbsp;&nbsp;&nbsp;* How it could expand over time if successful<br/>* End with one “low-effort experiment” I could run this week to test demand.\"<br/><strong>End Prompt</strong></p><p>There is no reason not to start building today.</p><p>Finally and what I'm the main one for this... is start writing. I love writing and I wish I would have started this sooner. You can write everyday and join me and see what happens. I will hold you accountable and keep you going!</p><p>Do you wanna start? Should I start a group? Reply to this email if you'd join it. Oh and Happy Monday.</p>"
  },
  {
    "day": 38,
    "title": "Don't Quit on Day 90: The Consistency Game",
    "content": "<p>No new sales, no new subscribers, no new followers</p><p>It can hurt big time if you have a day like this, a week, a month.</p><p>It all depends, but no matter what, if you don’t see the numbers going up, you get upset unless the number is your weight, then it’s nice to go down.</p><p>But everyone deals with this. For me, I have an end goal. <strong>Turn writing into my full-time job.</strong></p><p>I understand I’ll have days that don’t push the needle and I’m ok with that. As long as I keep on pushing.</p><p>You always hear the best become the best in the quiet in the silence. Practice makes perfect right?</p><p>I think so but sometimes I don't know all I know is I’m gonna keep on publishing everyday even if I don’t see an increase.</p><p>I did this thing years ago where I posted the same picture daily to Instagram. On day 90… it blew up for more followers than ever.</p><p>90…… days</p><p>Don’t get discouraged. Keep going if you do it enough and consistently one day it will all click and like I’ve mentioned before, know when it’s not working.</p><p>P.S. - Everyone has a goal. Mine is to turn this newsletter into my full time job. I plan to write every single day till that happens and then once it does continue to write every single day. I think it would be cool 10 years from now. I'm still writing this and you can say I knew him when he had 100 subscribers.....</p>"
  },
  {
    "day": 37,
    "title": "The Plan: Why I Don't Regret Choosing Writing Over SaaS",
    "content": "<p>I plan to never stop writing this newsletter. It will be a way for you to know I've died if they stop sending. I am on day 40 and with 19,345 left to go till my 90th birthday. I have no plans of stopping!</p><p>Haha, that's crazy to think about, but really, I just love writing these. but.. I'm not making any money. So it's like a double-edged sword. I could of built 10 different micro saas's and been making some money, but I chose this.</p><p>That's ok. I don't regret it... the thing is, you always wanna do something you enjoy. I know some of you will argue and say But money is what drives me. I get that, but the majority of people who got \"rich\" got mega-rich in a year? very little. People accumulate wealth over time.</p><p>The ship fast mindset works but you have to do it a bit differently. Build out little businesses like Marc did and over time they will compound.</p><p>He didn't make 100k on his first product. But he did make it on CodeFast. But that was years in the making.</p><p>So what I'm saying is... <strong>start today... Build now</strong> and don't let everyday consume you.</p><p>Do a structure that works for you. I had to stop posting to EVERY social media because it was to much.</p><p>So now I just post to X, LinkedIn, Medium, and Threads a day, with 2-3 times a week I try to make it a video. It works for me. My LinkedIn game can improve. Whenever I get enough money saved up, I'll buy Justin Welsh's LinkedIn Course.</p><p>When they say do something you love because it will never feel like working... Is true. But the reality is even fewer will be able to be paid a full-time salary for what they do. If you do... then hold on to it. its precious.</p><p>How was your Monday? Do anything fun? Hopefully, you're working on your side projects a little. Would love to hear about them. Hit that reply button. I respond to everyone... no one has replied in a few days so I'm sad I got no one to talk to!</p><p>Also, if anyone wants to sponsor this newsletter. Feel free to reach out. It's $10/issue and you can book 1 month in advanced (since I'm writing everyday). I also will give discounts for multiple ad spots. Nothing fancy it will be in this section as a P.S - > Like you always see me do. But since you will be one of the first sponsors I'll share it to my 6k followers on X as well and my medium article. So really the first few people will get tons of exposure. I need $200 to pay a bill. So once I hit that amount, I will close ad spots down again.</p><p>Ok bye.</p>"
  },
  {
    "day": 36,
    "title": "My Biggest Failures (And What I Learned)",
    "content": "<p>I have failed so many times that I couldn't help myself and write down everything I've learned. Hopefully it helps you. You can read the entire story/book for free here</p><p>If you wanna support me leave a comment on the story, clap it so others will get pushed it.</p><p>Tomorrow's newsletter is gonna be a gem! But today you can read all about how much I've failed.</p><p>Talk soon!</p>"
  },
  {
    "day": 35,
    "title": "The Train Analogy: Why You Should Be Writing on Your Commute",
    "content": "<p>The funny thing is, they go so fast, but you don’t move at all.</p><p>I have lots of time to think on my commute daily, and I’m pretty much writing for the entire time.</p><p>Why? Because why not? I wanna be the person everyone follows for my writing. They open my emails to laugh, learn something, and think.</p><p>Thinking is so important. As you get older, the more you think and interact with people, the better. I don’t wanna stop writing, and trains showed me that.</p><p>The crazy thing is, you can too. There is time in your day when you can write, build whatever you wish.</p><p>But to me writing is the easiest. Put your thoughts on your phone, a notebook, and share them with people. You’d be surprised how many wanna read it.</p><p>If you watch TikTok for 30 minutes a night… instead write for 15, watch for 15. Over time, I bet you the writing will be longer than the watching.</p><p>Writing not your thing?</p><p>You can read, talk with friends, whatever you want. The people who get ahead aren’t wasting time with the fun stuff; they are doing the boring stuff.</p><p>So the train goes fast, but so can you. Make your time valuable, box out time to think and improve. Do that every day and you’ll be surprised.</p>"
  },
  {
    "day": 34,
    "title": "2 Keys to Keeping Newsletter Subscribers (The TLDR Formula)",
    "content": "<p>I’m not claiming to be a retention genius, but after thirty-plus issues I’ve learned a few things about keeping subscribers reading.</p><p><strong>1. Nail the subject line.</strong></p><p>Yes, it sounds obvious. It’s still 90% of the game. Write the email first, then pick a line that teases the core promise in two or three words. Curiosity beats clever every time.</p><p><strong>2. Earn every scroll.</strong></p><p>Most people won’t read to the end, so front-load the value. Hook them in the first paragraph the way YouTubers hook viewers—tell them what they’ll get if they keep going.</p><p>Make the writing easy to skim. Short paragraphs. Clear transitions. No fluff. Social feeds trained everyone to process information in seconds, so respect the pace.</p><p>That’s why TLDR thrives. Three sections, two items in each, one punchy summary per link. Simple, predictable, useful.</p><p>People don’t read TLDR because they’ve never seen the news—it’s because the summaries hit faster than the original articles. That’s the bar. Be different, be concise, and give them a reason to stay subscribed.</p>"
  },
  {
    "day": 33,
    "title": "Life in 2040: The AI-Driven World",
    "date": "10/21/2025",
    "content": "<p>Life in 2040 will look nothing like the future we were promised.</p><p>Remember when everyone said we’d have flying cars by 2020? That never happened. But with the pace of AI right now, 2040 will still be wild.</p><p>Will we cure cancer? Live on Mars? Maybe. What I know is software will change faster than ever.</p><p>Here’s my guess. Apps will be generated from a single prompt, fully functional in minutes. The hard part won’t be building—it’ll be marketing. Audiences won’t trust social feeds packed with AI-generated noise, so they’ll lean on personal channels like newsletters where real people show up daily.</p><p>Influencers won’t all be human. AI avatars will run accounts, push narratives, and sell products for brands that keep the scripts tight.</p><p>Companies will look for creators and teams who can steer these tools with a steady voice. Imagine launching a fully automated content creator that still feels human because you programmed the salt, not the sugar.</p><p>If I stay consistent, by 2040 I’ll have written more than 5,000 issues. That track record will make my brand more trustworthy than any synthetic feed. That’s the moat: showing up in people’s inboxes as an actual person.</p><p>So what do you do right now? Learn to tell stories. Build a community of peers. Ship apps fast if you want, but focus on the message. Without marketing, the code means nothing.</p>"
  },
  {
    "day": 32,
    "title": "My Lean $30/Month Content Stack",
    "date": "10/20/2025",
    "content": "<p>I only use three tools to keep my content wheel turning.</p><ul><li>Email Octopus - where I send every newsletter</li><li>ChatGPT - where I clean up grammar and tighten headlines</li><li>Typefully - the dashboard that lets me post to X, LinkedIn, and Threads at the same time</li></ul><p>That’s it. Why so little? The ideas come from my head, and I want to keep it that way. Typefully saves me hours each week without writing for me, so it still feels like my voice.</p><p>What does it cost?</p><p>Email Octopus is technically free, but I upgraded to the $9 plan for longer automations even though I don’t really need them yet. ChatGPT is free because all I do is polish what I already wrote.</p><p>Typefully is $149 per year, which breaks down to about $12.50 a month. Add that to $9 for Email Octopus and $8 for X Premium, and the stack costs **$29.50 per month**.</p><p>That’s the only number that might climb as my list grows, but that increase will mean the emails are working. There are other tools I’d love to buy, but this lean setup keeps me disciplined. I’m on a tight budget, and the goal is to make more than I spend, so the stack stays simple.</p>"
  },
  {
    "day": 31,
    "title": "The 1 Post to 8 Channels Automation Plan",
    "date": "10/19/2025",
    "content": "<p>Automation is key to anything. The problem is you have to figure out how to use it properly. Don’t just type into ChatGPT or other platforms do this for me you need systems, guidance etc.</p><p>What do I mean? I recently figured out this newsletter needs to be shared across all channels. I currently post to X, Linked In, Threads , and Medium. But with automation I can post to more: TikTok , Facebook, Instagram , YouTube, Pinterest. That gives me 5 more places to go viral get more users. That I’ve never posted any of my content to.</p><p>So how can I do that? Well there are tools like post bridge that can help you but you need to make the content. So how can you make it? There are plenty of ways to make it. For me since it’s my own newsletter and I’m using the name I’m gonna just use simple photos and share ideas. Like a slideshow etc. This way it be a video that you can share across all those last 4. So..</p><p>5 Text focused channels: X, Linked In, Facebook, Threads , Medium, Pinterest (with images )<br/>3 video focused channels: YouTube , Instagram , TikTok</p><p>1 “post” automatically sent to all different channels. Daily… for the next 30 days and I bet I’ll see results. We will revisit this and see how good I can do with that!</p><p>For you … think of a way to get going on marketing. But remember don’t go crazy. What do I mean? pick 1-2 channels to heavily focus on while the others are just repurposing the content with AI prompts to format them for those channels. So you write thread for X. Take that and turn it into a short video with AI, slideshow, etc for video and convert the thread into the correct formats for other channels.</p><p>All that matters is you start doing it.. do it for 30 days and I promise you you’ll see results.</p>"
  },
  {
    "day": 30,
    "title": "30 Days In: What I've Learned (Doubt, Money, and Dreams)",
    "content": "<p>30 days of writing this newsletter every single day. That's kinda crazy because I haven't focused on something this long and stayed with it in a long time. Prolly since the days I was playing basketball.</p><p>Here's what I learned:</p><ul><li>Major Doubt</li><li>Wanna Quit</li><li>Look at the subscriber count</li><li>Marketing</li></ul><p>So let's just start it right off with... I beat myself up on anything. I know things take time, but man, I am not good at it.</p><p>I have been product/ idea hopping since I was born, I feel like. The only thing that ever mattered to me was basketball. So it's nice to get into a groove, and writing every single day is surely awesome. But I didn't believe in myself this entire time. I even changed the type of newsletter this would be a few times. I went from it being about soloprenurship, to personal, to side hustles. So I switched, but I kept writing every day. Now I have a simple way to explain it. \" A Daily newsletter that makes you think\"</p><p>Why this? Well, I wanna write about whatever I want but also make it push you. You are the reason I get to write every day... So I wanna make it benefit you.</p><p>I've wanted to quit a few times on this and start something else because let's face it. During these 30 days... No money has come in from this newsletter. Which isn't a problem. But when you come from running micro saas's that get sales within their first 24 hours, not having anything for 30 days is a lot.</p><p>But the bright side is I haven't really \"sold\" anything. I am working on a short boo,k I guess, but not sure what I wanna do with it.</p><p>I have most likely looked at the subscriber count more than anything I've ever done. In the grocery store.. refresh list. Going to bed, refresh the list. waiting to pick up the kids from school, refresh the list. The number of times I've done it is kinda obsessive.</p><p>Marketing hasn't been good because I've switched so much in my marketing efforts. One thing I have done is write pretty much every day for Medium. You can follow my Medium account</p><p>Now that I talk about \"everything,\" I can make my marketing different and better? Not really sure, but the idea is to make it work. I will keep on talking and you can help me by keep on sending my issues to people.</p><p>Remember <strong>Never give up on your dreams.</strong> I have $-49 in my bank account while writiting this waiting for my new job to start. But I'm gonna stick with writing because I love it even if I never make a dollar from it.</p><p>Do something you love and you'll never feel like you worked a day in your life. That saying is true but they forget one thing you eventually need to make money. But most things people wanna do that they can DO they will make money if you stay consientent.</p><p>What do I mean by this?</p><p>I wanted to be a professional basketball player. Play for the NY knicks. That was my dream. But reality was I wasn't good enough. Yeah I played in college, but the Pros is a different league. It's another animal that I wasn't good enough for. So that was my dream. But my other dream has always been to write. What? I don't know a book maybe but as I said before, I love just writing and seeing what comes out. This is all top of my mind no edits, no reviews. That's how I write....</p><p>So this is a dream that can't happen right. You can do what you love but I can't go play basketball. Maybe over in europe but I'm to old. The point is if it's attainable like you wanna build a SaaS then sure you can do it. Nothing is holding you back now.</p><p>That's the cool thing about life right now. We are in the Dot com bubble (I was to young) where millionaires were made overnight. <strong>Don't miss this opportunity.</strong></p><p>Do 1 boring thing every single day and you'd be suprised what you can do. Writing not your thing? Make templates, sell them on Etsy. The possibilities are endless. Don't waste your time.</p><p>Build that thing that you love to do, and like me, after 30 days, see what happened. You'd be surprised. I may not of made any money, but I got almost 100 subscribers who read every issue + some of you have been so kind in your responses. I reply to all, so feel free to reach out on anything or tell me something cool you are working on!</p><p>30 days , 30 newsletter issues. Thank you for reading. I'm not stoping so here is to another 3000!</p>"
  },
  {
    "day": 29,
    "title": "Life Is Hard.. But you keep going",
    "content": "<p>Life Is Hard.. But you keep going</p><p>Look, everyone is struggling in this word and you never really know what is going on.</p><p>But the thing isn’t you need to stop what you are doing to help. You need to stop what you are doing to <strong>help yourself.</strong></p><p>You only get one life. You only get once chance to make it great. <strong>Make it great.</strong> Don’t waste time doing stuff you don’t wanna do. Don’t waste time being in relationships you don’t want to be in.</p><p>Build that business, build that newsletter, find that side hustle you are passionate about. No one is gonna stop you but you.</p><p>I use to think I had the hardest life possible. We all do then you meet someone who has it worse than you, and you realize… wait, maybe my situation is not that bad.</p><p>I lost my job, my savings, took out my entire 401k, personal loans, and more just to stay afloat. I felt like a failure to my family and my kids.</p><p>But my kids just said, “Daddy, I love when you get to park with us”. They don’t care where you sleep, what you do. All they know is they want you to be around and talk to them.</p><p>So now I look at life differently. I’ve never focused on money, but I do want to get my time back with my kids. So money is important in that sense. But you need to do stuff that let’s you sleep at night and earn.</p><ul><li>Digital Products</li><li>Micro SaaS</li><li>Newsletter</li><li>Building anything in AI.</li></ul><p>Money comes and goes, but those memories last a lifetime. Make memories without sacrificing everything. Life is too short to do nothing with it.</p>"
  },
  {
    "day": 28,
    "title": "Called a Fraud: The Reality of Solopreneurship & Debt",
    "content": "<p>Someone responded to one of my newsletters recently and called me a fraud. And it really upset me... I don't consider myself a fraud... I've never really said I've made millions from all my side hustles. All I've said has happened. But I am also broke.</p><p>If you have been following me on X you know the full story. So I won't bore you with the details. But I'm broke even with making over 30k from one \"product\". My life isn't perfect... I've taken out loans to stay afloat , picked up side jobs to pay the bills. But I know soloprenurship is for me and that's why I started this newletter.</p><p>If I can't find a product or a service that can make me money then I'll share those with you to make you money. You win, I win because you'll share where you heard the idea. So get ready for lots of new ideas and ways to make money online solo.</p><p>Remember I'm not perfect... I am not saying everything I write is 100% true. 100% of it is what I beleive from learning about it myself, dealing with it, and just a gut feeling that this is where things are going.</p><p>If you have been subscrbed for awhile you know I mention it time and time again. AI is gonna take over so <strong>STORYTELLING and personalized content will become key.</strong></p><p>It's why I'm only writing this newsletter daily and talking about anything I can to help you become a better you and make more money cuz look. I got to make more money too (not sure how yet) but I'm in debt close to 100k (this includes my wife's debt) and we live in NY... so I got a long way to go.</p><p>I'm 37 and I don't wanna spend my older years worried about money... I wanna take my kids to Disney land and not budget every cent of it, I wanna go visit europe and travel down the french riveria (I've never been the Europe). I'm not looking to get Elon Musk or Zuckerberg rich and I don't think you are either. I wanna live comfortably within my means but be able to do stuff from time to time.</p><p>So that's really what I'm trying to teach and share. I'm pretty much at my lowest point in my life and to me the only thing I can see is going upward. It will be cool to look back on this in a year, 5 years, 10 years, and see where I am then. I plan to still be writing this newsletter every day... think I'll be at 1 million subscribers by then?</p>"
  },
  {
    "day": 27,
    "title": "Still Broke, Still Building: My $100K Debt Goal",
    "content": "<p>Someone responded to one of my newsletters recently and called me a fraud. And it really upset me... I don't consider myself a fraud... I've never really said I've made millions from all my side hustles. All I've said has happened. But I am also broke.</p><p>If you have been following me on X you know the full story. So I won't bore you with the details. But I'm broke even with making over 30k from one \"product\". My life isn't perfect... I've taken out loans to stay afloat , picked up side jobs to pay the bills. But I know soloprenurship is for me and that's why I started this newletter.</p><p>If I can't find a product or a service that can make me money then I'll share those with you to make you money. You win, I win because you'll share where you heard the idea. So get ready for lots of new ideas and ways to make money online solo.</p><p>Remember I'm not perfect... I am not saying everything I write is 100% true. 100% of it is what I beleive from learning about it myself, dealing with it, and just a gut feeling that this is where things are going.</p><p>If you have been subscrbed for awhile you know I mention it time and time again. AI is gonna take over so <strong>STORYTELLING and personalized content will become key.</strong></p><p>It's why I'm only writing this newsletter daily and talking about anything I can to help you become a better you and make more money cuz look. I got to make more money too (not sure how yet) but I'm in debt close to 100k (this includes my wife's debt) and we live in NY... so I got a long way to go.</p><p>I'm 37 and I don't wanna spend my older years worried about money... I wanna take my kids to Disney land and not budget every cent of it, I wanna go visit europe and travel down the french riveria (I've never been the Europe). I'm not looking to get Elon Musk or Zuckerberg rich and I don't think you are either. I wanna live comfortably within my means but be able to do stuff from time to time.</p><p>So that's really what I'm trying to teach and share. I'm pretty much at my lowest point in my life and to me the only thing I can see is going upward. It will be cool to look back on this in a year, 5 years, 10 years, and see where I am then. I plan to still be writing this newsletter every day... think I'll be at 1 million subscribers by then?</p>"
  },
  {
    "day": 26,
    "title": "Don't Stop, Keep Going: My Daily Reminder",
    "content": "<p>I have an artist that I've always listened to named \"mike\" he made a song 6 years ago called \"keep going\" and ever since I listened to it. I never stopped thinking about it.</p><p>In the song he talks about always wanting more of X , Y , Z. And that's how I take my life. Working my butt off even when I'm at my lowest (right now).</p><p>\"Don't stop, keep going.. Cuz you never gonna be here again\"</p><p>As soloprenur, we are always trying to figure out what to do next, what to improve, and whether we should quit. The answer is:</p><p><strong>\"Don't Stop, Keep Going\"</strong></p><p>This is your reminder that you got it. Soloprenurship is hard. We all are living proof of it but the reason we do it is because we love it.</p>"
  },
  {
    "day": 25,
    "title": "Blogging is NOT Dead: The Content Center Strategy",
    "content": "<p>Blogging isn't going anywhere.... It may change and be harder to rank on Google and other platforms, but it's still essential.</p><p>Why?</p><p>Blogging can really be the center of your content. Write a detailed blog article and you can share it on every single platofrm without doing much. Simply just put the final prompt into chatgt but it may not be smartest for the most out of your money.</p><p>A blog can turn into multiple things. You should be writing that blog post, then turning it into a X article, Medium Article, and places like X. You can use a tool like Typefully, which allows you to post to X, LinkedIn, and threads together. This means you just have to put the whole story into ChatGPT and say Give me a breakdown of posts I can share in the night, etc.</p><p>This email was short as I'm getting ready for my 5 day course!</p>"
  },
  {
    "day": 24,
    "title": "The Shiny Object Syndrome: Stick to Your Product",
    "content": "<p>I learned the hard way. I didn’t stick with my products long enough, so I left money on the table. I kept jumping to the next idea before the original one even had a chance.</p><p>Here’s the fix: commit to one thing for at least thirty days. Show up daily, build, and promote. Habits beat hype.</p><p>I’m on day twenty-four of writing and I already see improvement—mostly because I stopped chasing shiny objects.</p><p>So the task is simple. Pick a project. Give it thirty straight days. Don’t switch lanes the moment something new pops up.</p><p>Build it. Talk about it. Give it time to breathe. You’ll be amazed how much can happen in a month.</p><p>Until tomorrow!</p>"
  },
  {
    "day": 23,
    "title": "How I Built Niche Tools and Made $30k",
    "content": "<p>I built Niche Tools, which was a database of \"free tools\" you could add to your website or create to make money from. Think of the Calculator site, generators, etc. It netted me over 30k before I sold it.</p><p>Here's how it started and why you need to start building now.</p><ul><li>I created a landing page on Carrd</li><li>Posted about it on X.</li><li>Charged $39 for a list of ideas.</li><li>After Stripe payment, I'd redirect them to the Google Sheets where the data was.</li><li>Email them a copy of the URL. Got 20 customers within a week.</li><li>Then, I decided to upgrade the website to have proper headings and other improvements. Bought ShipFast (the boilerplate you get with CodeFast) and built my first adequate site. It only cost me $199</li><li>Added more ideas</li><li>Marketed to my audience</li></ul><p>All from a database of ideas.</p><p>Why haven't you started? AI is a game changer. Get moving.</p><p>P.S - I'm almost done with my 5 day Crash Course in soloprenurship. You will auto get it for free for staying subscribed. Don't miss it!</p>"
  },
  {
    "day": 22,
    "title": "My Favorite Player's Mistake & The Urgency of Starting",
    "content": "<p>I'm a basketball guy and have always been. Ever since I was a kid I wanted to play college basketball at Duke. Unfortunately, I wasn't good enough to play for Duke. But I did get offer to Rider University. I ended up turning it down and went to a small D-3 school called Scranton University.... Yes I was by the office before the office was a thing.</p><p>Anyway, my favorite player was Jay Williams. A great guard from Duke who had one of the best games I've ever seen in my life. With a minute left, he somehow scored 10 + points to give Duke the win. It was the craziest thing I've ever seen. So I followed him all through his years at Duke. Then he got into the NBA..... and if you know the story, he screwed his career in no time. Got in a motorcycle accident and boom. His career in the NBA was over. He was gonna get paid well and do big things, but it was all gone in a minute.</p><p>So why haven't you started your newsletter? Your blog? Your Micro SaaS? You never know what tomorrow's gonna bring and you also don't know how long the hype will last.</p><p>AI is taking over, and I'm pretty sure everyone will be building with it... which makes it harder for you to get ahead. So instead of just not doing something.... **do it.**</p><p>because you don't wanna end up like jay and have to be a news anchor the rest of your life because you can't play the game you love anymore.</p>"
  },
  {
    "day": 21,
    "title": "Attracting Users While You Sleep: 1 Post to 6 Places",
    "content": "<p>Acquiring users is the most crucial aspect for any business. As a solopreneur, it's the most crucial and difficult part. I was never a good marketing (I'm still not working on it), but if you are like me and trying to build a business solo. It's not easy... I have been writing this newsletter daily for the past 21 days, and I've seen a few things + know a few things from previous products. I know my time will get even less when I start my new job next week.</p><p>So, how do you attract new users while you sleep? <strong>Automations..... and X Articles.</strong></p><p>Now... hear me out. I recently published an article on X and it has done decent. You can read it here (make sure to like, comment etc it helps me out). The article was simple and it was my firt test at using it.</p><p>My plan is simple. Write 1 post a day use it all on all socials in different formats....</p><p>How? It's simple.</p><ul><li>I write my post/topic in a google doc. No edits, no AI, just me and my thoughts and the article/post I'm trying to publish.</li><li>Once I finish, I'm ready for the next step. Cleaning it up.</li><li>I run it through ChatGPT to fix grammar errors and punctuation errors. Then I re copy it to my google doc as a new verision.</li><li>I have Grammarly Pro, so I take this time to check if ChatGPT made any errors and read over the blog post one more time before publishing it to X, LinkedIn, Medium, Threads, Reddit (if it makes sense) my blog, and now X articles.</li></ul><p>1 piece of writing, spread out to 6 different places. That's 6 times it can go viral all from 20-30 minutes of work. This is why **AI is your friend as a solopreneur**. I just completed my entire day of marketing in under half an hour. Allowing you to get back to what matters... building your business.</p><p>For example; I use SuperX to schedule some of my content. This allows me to focus on finding more content or simply just finishing a few things in the house. You can use chatgpt or any of the writing tools as well but none of them are as good as the Super X + chatgpt does a decent job for you.</p><p>P.S. - I am putting together a free 5-day email course on soloprenurship, so look out for the invite to that.</p>"
  },
  {
    "day": 20,
    "title": "Billion Dollar Product Formula (A ChatGPT Prompt)",
    "content": "<p>I am a firm believer in finding a billion dollar product and latching onto it to earn money.</p><p>What do I mean by this? Shopify, facebook, instagram, tiktok, etsy... X what do they all have in common?</p><p>They all are big companies that make millions if not billions a year. So what should you do? Build something around them.</p><p>Why? There is a market for them. They already have the users. Just find a product that you can make from it.</p><p>Here is a prompt that you can use for any big company:</p><blockquote>\"Generate 10 startup or micro-SaaS ideas inspired by [COMPANY NAME]. Each idea should reflect the company’s core value or system (e.g., community, attention, engagement, discovery). For each idea, include: 1. Concept name 2. What it does 3. How it mirrors [COMPANY NAME]’s core mechanic 4. Who would use it 5. How it could make money Keep the ideas realistic for a solo builder or small team.\"</blockquote><p>You will be suprised at how many options you get. Here' an example: This is a simple yet good idea. Now are there plenty of these around? Sure. But no one is doing it in the right way to capture millions of users. If you stick with it.... you can do well I'm sure of it.</p><p>Even if you don't know how to code you can learn + get templates from one of the best indie hackers around Marc Lou and use take is codefast course. I earned over 50k from his boilerplate alone. **start building.** You'd be suprised what happens in 6 months.</p><p>P.S. - I'm on day 20 of writing this daily newsletter. The goal is to grow this to a million dollar business by sharing what works and ways to make money on the internet each day. But I don't have 1 set audience which I know is never good. So I'm asking you. What would you like to see me write about? If I find it interesting I'll write about it one day!</p>"
  },
  {
    "day": 19,
    "title": "The Art of Blogging: 10% Human is Still King",
    "content": "<p>To write a good blog post takes time. AI can help you in the research department but you really need to put your own spin on stuff to get anything that will attract users, rank on google and do well for your blog, post or whatever you are working on.</p><p>How do I know this? I was a blogger back in the day...nothing special I did it in crazy simple niches that no one knew about but it's where I made my first internet money.</p><p>The blog was simple.... it was right when twitch and other sites were taking off and this concept of \"streaming\" video games was a thing.</p><p>The blog? Help you become a better stream... my best article was Best Streaming PC's and I'd link to top Products on amazon. I was getting 4% and killing it with 100's of users coming to my site daily. With some of these products selling for $1,000+ I was making decent money.</p><p>Then it all came down.. I stopped caring about the blog (typical me) and start focusing on another blog, the content got old and big players like forbes, toms hardware and others starting seeing the trend. They built out fully detailed articles with actual reviews (they bought the products as well). That was my first taste of ranking on google. <strong>I was hooked.</strong></p><p>Now while writing is easier because the ideas come faster, the highlights / overviews are easier to get. You still need to story tell and keep the reader in but also allow them to skim if they want. I don't have stats on it but my guess is 90% read the article till they see a highlight or \"top\" items. That's why lists up top or table of contents have become so popular.</p><p>Now every AI wrapper is trying to help you write blog posts. The artform is dying to just AI generate slop.</p><p>I still think if you do 90% AI and even as little as 10% human. You will rank on top of google.</p><p>So what should you do? **Start blogging.** If you don't wanna own it medium is a good platform and I've commited to writing daily on there and share results.</p>"
  },
  {
    "day": 18,
    "title": "My 2-Year Indie Hacking Timeline (Layoffs, $10K Months, and Debt)",
    "content": "<p>2 years old is kinda crazy to think about because I remember her just being born and now my little girl is 2. The crazy thing to me is not just how big she is getting but what has happened in the past 2 years of my life I would never imagine. The memories I have been able to have with her as I've indie hacked my way pay check to pay check will never replace anything I ever do.</p><ul><li>I came across a Marc Lou post back in 2023 right around the time she was born. I started taking indie hacking more serious.</li><li>I took the skills I had building from my crypto days to building some serious products.</li><li>I launched Niche Tools in November of 2023 a month after my daughter was born. It started to take off and I did decent with my sales.</li><li>I lose my job in January of 2024.</li><li>I apply for jobs in the morning. Hang out with all the kids from 11-bedtime and grind my side hustles from whenever they go to sleep till 1-2am or whenever I fall asleep.</li><li>February 2024 I make 10k from Niche Tools while sticking to this format.</li><li>I continue to indie hack making ends meet with my Niche tools and few other products to pay bills.</li><li>I take out a loan to cover rent , bills etc in June 2024. I sell niche tools to cover rent etc.</li><li>I take out a second loan to cover bills etc in Oct 2024.</li><li>I start my new job Oct 28. I buy back niche tools. I make another 10k from it over Dec, January, Feb.</li><li>I get let go from the new job May 30th (no payout, no insurance etc).</li><li>I take out my entire 401k savings to cover rent , bills health insurance through cobra (not cheap) etc.</li><li>Sell all of my products (niche tools again, my domains) get hired by the best indie hacker around and make ends meet for September and October.</li><li>Sign my new offer letter for my Job Going to start Oct 13.</li></ul><p>The point is... a lot can happen in 2 years. Now image if I was only focused on one thing? I should compound and do better right?</p><p>That's my thought and that's why this newsletter is my main focus forever. Everything I do will always lead me back to talking to you because if you are consisent things should / will pay off. 99% of people don't contiune or quit after X amount of time... don't be that person. keep going. You got this. Talk tomorrow!</p>"
  },
  {
    "day": 17,
    "title": "The Brutal Honesty of My 2-Year Journey",
    "content": "<p>2 years old is kinda crazy to think about because I remember her just being born and now my little girl is 2. The crazy thing to me is not just how big she is getting but what has happened in the past 2 years of my life I would never imagine. The memories I have been able to have with her as I've indie hacked my way pay check to pay check will never replace anything I ever do.</p><ul><li>I came across a Marc Lou post back in 2023 right around the time she was born. I started taking indie hacking more serious.</li><li>I took the skills I had building from my crypto days to building some serious products.</li><li>I launched Niche Tools in November of 2023 a month after my daughter was born. It started to take off and I did decent with my sales.</li><li>I lose my job in January of 2024.</li><li>I apply for jobs in the morning. Hang out with all the kids from 11-bedtime and grind my side hustles from whenever they go to sleep till 1-2am or whenever I fall asleep.</li><li>February 2024 I make 10k from Niche Tools while sticking to this format.</li><li>I continue to indie hack making ends meet with my Niche tools and few other products to pay bills.</li><li>I take out a loan to cover rent , bills etc in June 2024. I sell niche tools to cover rent etc.</li><li>I take out a second loan to cover bills etc in Oct 2024.</li><li>I start my new job Oct 28. I buy back niche tools. I make another 10k from it over Dec, January, Feb.</li><li>I get let go from the new job May 30th (no payout, no insurance etc).</li><li>I take out my entire 401k savings to cover rent , bills health insurance through cobra (not cheap) etc.</li><li>Sell all of my products (niche tools again, my domains) get hired by the best indie hacker around and make ends meet for September and October.</li><li>Sign my new offer letter for my Job Going to start Oct 13.</li></ul><p>The point is... a lot can happen in 2 years. Now image if I was only focused on one thing? I should compound and do better right?</p><p>That's my thought and that's why this newsletter is my main focus forever. Everything I do will always lead me back to talking to you because if you are consisent things should / will pay off. 99% of people don't contiune or quit after X amount of time... don't be that person. keep going. You got this. Talk tomorrow!</p>"
  },
  {
    "day": 16,
    "title": "The Indie Hacking Roller Coaster: Why I'm Sticking to One Thing",
    "content": "<p>2 years old is kinda crazy to think about because I remember her just being born and now my little girl is 2. The crazy thing to me is not just how big she is getting but what has happened in the past 2 years of my life I would never imagine. The memories I have been able to have with her as I've indie hacked my way pay check to pay check will never replace anything I ever do.</p><ul><li>I came across a Marc Lou post back in 2023 right around the time she was born. I started taking indie hacking more serious.</li><li>I took the skills I had building from my crypto days to building some serious products.</li><li>I launched Niche Tools in November of 2023 a month after my daughter was born. It started to take off and I did decent with my sales.</li><li>I lose my job in January of 2024.</li><li>I apply for jobs in the morning. Hang out with all the kids from 11-bedtime and grind my side hustles from whenever they go to sleep till 1-2am or whenever I fall asleep.</li><li>February 2024 I make 10k from Niche Tools while sticking to this format.</li><li>I continue to indie hack making ends meet with my Niche tools and few other products to pay bills.</li><li>I take out a loan to cover rent , bills etc in June 2024. I sell niche tools to cover rent etc.</li><li>I take out a second loan to cover bills etc in Oct 2024.</li><li>I start my new job Oct 28. I buy back niche tools. I make another 10k from it over Dec, January, Feb.</li><li>I get let go from the new job May 30th (no payout, no insurance etc).</li><li>I take out my entire 401k savings to cover rent , bills health insurance through cobra (not cheap) etc.</li><li>Sell all of my products (niche tools again, my domains) get hired by the best indie hacker around and make ends meet for September and October.</li><li>Sign my new offer letter for my Job Going to start Oct 13.</li></ul><p>The point is... a lot can happen in 2 years. Now image if I was only focused on one thing? I should compound and do better right?</p><p>That's my thought and that's why this newsletter is my main focus forever. Everything I do will always lead me back to talking to you because if you are consisent things should / will pay off. 99% of people don't contiune or quit after X amount of time... don't be that person. keep going. You got this. Talk tomorrow!</p>"
  },
  {
    "day": 15,
    "title": "15 Days Strong: Why You Should Write More",
    "content": "<p>It's already day 15 of writing every single day and I feel like I've hit a good streak. I'm writing each day and seeing an improvement in tons of my struture. I think it is so important to write everyday and it doesn't even have to be about anything special. It's been proven when people write they become happier. There is no better feeling than a paper and pen in bed writing about this newsletter issues.</p><p>Just like everything in life you have to do it for more than a few days. We are at 15 day of writing this and we have already amazed 60+ amazing subcribers. The funny part is I still don't have a \"niche\" I am just talking to you on whatever topics I want and you still join and read. Still waiting for you to reply so we can have a nice chat... but I won't hold you to replying.... just yet. **So write more**</p><p>It's how you get better. Michael Jordan worked out before and after games becaue he wanted to get better. The same thing applies to writing. We should all be writing daily. It only makes sense. It helps you in so many ways:</p><ul><li>Mental Health</li><li>Memory</li><li>Happyness</li></ul><p>Plus if you keep at it with where AI is going it's going to be more important than ever to have a \"voice\" and letting people understand you wrote something insead of AI. That's the million dollar product and if you can figure it out you are set. You wonder why I keep saying 1 million for this newsletter.... The only reason is I want it as the goal to say I can take a day off if I want. So for me to hit 1 million isn't gonna happen anytime soon. But I'm gonna show up every single day and do something till I does.</p>"
  },
  {
    "day": 14,
    "title": "The Views-to-Users Funnel: TLDR and Cross-Promotion",
    "content": "<p>It's simple.. Get more views, sell more of your product or really anything you are trying to do. The hard part? Getting the views. Everyone can have their own way of getting more views because views convert to users. If you are a b2c people are on Tiktok, Intagram, Youtube etc.</p><p>The main thing is you need to understand where your audience is. If you are posting on Linked In you may not get the same engagment as you would on Tiktok. One of my favorite newsletter is TLDR. He is always looking for sponsorships and charges a hefty penny for them and he runs those ads on Linked In.... because that's where his audience is for that specific item. When he was looking for subscribers, he mentioned in a podcast that he used quora to get his initial subscribers.</p><p>for me my plan is simple. GO viral on X and other writing platofrms and keep on building out this newsletter to help you become a better writer. Because as I've mentioned AI is taking over and <strong>storytelling will become an even bigger skill</strong> that I am betting all my eggs on. None of my content is AI generated this is straight from my mind to these emails. I don't prep, I just write and then hope it makes sense. So how can you go viral?</p><p>Focus on one platform. If you are doing like me am doing... writing. X is a good start and with tools like typefully (affiliate link) you can cross-promote seamly so you are getting users on other social medias. We are only on day 14 and I have seen improvements in my writing and how to get things down and explain them. I have a long way to go without having run on sentences etc... but it's progress for me. So we will continue on this route. In the next few weeks I'll be posting detailed threads to socials to see if that can drive traffic.</p><p>New here? make sure to subscribe</p>"
  },
  {
    "day": 13,
    "title": "Build Small: The Power of a Core, Royal Audience",
    "content": "<p>Small is better.</p><p>Why?</p><p>No one can just jump right into this world and think that having millions of followers happens. No... it not like that. It takes time and effort.. That's why many fail.</p><p>You see that small is better because once you have that core group of friends, followers, or subscribers. The rest kinda falls into place. Your followers will grow slowly as long as the initial ones you start with are active. Do you know who's always in your comment section etc? I do. These are the people you ping or write to on the side to get feedback. Your first users, your base community... **They are the core of your business. Treat them like royalty.**</p><p>There is a reason you don't hear of many cases where someone blows up in a month.... most people grind for months, years before they get their big break.</p><p>The good thing is with small audiences is you are able to keep those people close to you and just like this newsletter you feel closer with them. I'm only writing to 53 of you right now. One day I may be writing to 50,000 but I'll never forget you.</p><p>Keep going and making an effort to become the best you can be. Remember everyone has a talent... you just gotta find it. Build small and watch it compound like crazy.</p><p>P.S. - I am writing once a day on medium if you are on there, I'd love for you to read some of my work.</p>"
  },
  {
    "day": 12,
    "title": "The Best Ways to Make Money Online Right Now (3 Methods)",
    "content": "<p>How to make money on the internet is changing year by year.</p><p>But if you wanna build it correctly here are the best ways to do it.</p><ul><li>**Sell your own product** - This one is obvious but lots of people don't understand how important this is. If you can build an audience then sell something to them you have a good chance of making good money. Become the expert.</li><li>**Affiliate Links** - If you are like me you have always built blogs around affiliate links. Back in the day I even was building web hosting blogs to promote high paying web host companies. This is no different now but no longer do you need to write it in a blog or post. You can simply post to Youtube/Tiktok and add your affilaite link.</li><li>**Sponsorships** - Build an audience like I metnioned before and then sell spots in where your audience is. This one is tricky because unless you have an email like I am doing, adding content on your social media to much with ads is a lot.</li></ul><p>There are plenty more ways to do this but imo these are the best ways to grow now. With AI taking over you need to build something that people want, grow an audience in a niche you love or else you will fall behind. I was able to build 10+ apps make 50K from them and sell them all off. All from AI and this course. Kinda crazy that you can build profitable side hustles in days.</p><p>What was the best way to make money you have seen? Do you agree with the 3 areas I've picked. Would love your feedback.</p>"
  },
  {
    "day": 11,
    "title": "\"Sell Me This Pen\": 5 Ways to Close the Sale",
    "content": "<p>Because it's not easy. \"Sell me this Pen\" (name that movie)</p><p>The thing is everyone can sell... but can you close. Everyone can give the details of their products, their newsletter, the thing they are building.</p><p>But.... **can you make some pay.**</p><p>That's the hard part but you can make it easier if you do a few things:</p><ul><li>**Market to the right audience.** A fisherman looking for new lures won't be interested in a new running shoe. Find where your audience hangs out and live there.</li><li>**Make the product sell itself.** Don't overcomplicate anything. Your thesis should make it dead simple for people to get why they should buy. 99% of the time people buy on impulse.</li><li>**Give yourself 3-6 months.** As someone who product jumped a lot and looking back on it now that I'm writing this newsletter everyday. I wish I focused on things for longer. Built a legit product then worried about expanding it.</li><li>**Talk to your customers.** If you have 1 person or 100 make sure you ask them for feedback. Just like this newsletter. I'd love you to reply to this email (I answer all emails) and tell me what you like, what you don't like. Where you think I should go etc.</li><li>**Don't get hurt if they say no.** Rejection happens you can google all those stats that say 1 in 100 or 3% of people don't buy on the first time etc. You have to sell someone 7 times before they will buy. They will buy it or subscribe if you do it right and are in their circle.</li></ul><p>So what should you be doing. You should be posting more on socials... adding more pSEO content to your site. Use free tools to build your brand aweareness. That's what I did with niche tools.</p><p>P.S. - Have you shared this newsletter with anyone? I'm gonna build a referral system with a leaderboard eventually, I think. To make it like a game. Thoughts?</p>"
  },
  {
    "day": 10,
    "title": "My Amazon Merch Story: Don't Ever Give Up",
    "content": "<p>It's hard to be motivated when you aren't getting sales, subscribers, followers. The thing is.. That's where most people fail. They stop. They move on try something new. That is why there is so many less people who make it.</p><p>Side Hustles are hard... But I've had success in the over the years. But it didn't happen over night and it didn't last for long.</p><p>You see I got in on merch by amazon way before anyone else did and I had killer designs. Not because I was an artist or someone with a talent but more becaue I knew the sayings people would love.</p><p>One of my most popular ones? Dunkie Junkie.... A play on the popular coffee chain Dunkin.</p><p>The thing was. I had 1,000's of designs and It didn't really take off for about a year but then it went crazy. I even posted about it on reddit and it became one of my highest posts.</p><p>but with everything I do... I stopped focusing on it because I wasn't enjoying it I wasn't getting the sales, subscribers I wanted (1-2 sales a day) so I moved on.</p><p>Then Christmas came and my earnings went insane. 2k , 4k , 10k (December) and I started posting new designs, but I think it was to late. My products did well but then 100's of copycats came in lowered their prices and my margins were at $0.</p><p>I moved on and the 2-3k a month I was making slowly went down till this past year where we hit $10-$15 a month.</p><p>Ok Matt so what is the point? **The point is... don't give up, don't ever give up.** Just because your idea doesn't \"hit\" you can always find another one or similar one. The point is to keep going.</p><p>Similar to how I'm publishing this newsletter to new heights everyday. You need to find something and stick to it remember it takes 66 days to build a habit. Start building one day.</p><p>P.S. - Not sure how I'm gonna do sponsors etc (way to early) but would love your feedback on how you would like to see this newsletter strutured going forward (paid days) or advertiers paying $20/day for it to be displayed in the bottom here where P.S. is.</p>"
  },
  {
    "day": 9,
    "title": "How to Get Subscribers (from Someone Who's Sold 3 Newsletters)",
    "content": "<p>Ok so... I know the title says how to get subscribers and you are most likely saying. Matt... you only have 42 subscribers to this newsletter... how do you know about subscribers?</p><p>Well first off... thank you for being early and being one of the first 42 subscribers... it means the world. Second off... ya caught me. I may not know exactly how to do it yet. But little known fact is I already built 3 newsletter and sold them before this one. But I ain't selling this one ever. You are to special to sell to the top dollar even if they offer me $10 for you. I ain't ever selling. So I'm not a noob to the newsletter game and my previous newsletter I grew all from reddit. You can learn more about that with this free guide on how to grow on reddit.</p><ul><li>A clean + easy to understand message converts</li><li>Don't overpromise but overdeliver.</li><li>Talk, don't sell</li></ul><p>The first one is something lots of people don't think about... if you don't understand what you as a reader are signing up for. Would you really sign up? Most likely not. Ensure you have a clear understanding of what your newsletter is about.</p><p>Don't over promise.... seems simple but too many people love to lie. \"This newsletter is read by 100k people and has an open rate of 45%!\" When in reality you have less than 1k and an open rate less than 30%. People are more willing to subscribe/take a chance on your stuff if they know you are being honest. **Be honest, let them see what your going through. You will get more conversions and true fans that way.**</p><p>Finally the biggest one of all. Even though I have 42 subscribers. I haven't gone down since I started.... Why? I am not selling anything. In reality I'm doing the opposite... I'm learning and sharing what I learn for free. If someone reads all of my issues till I make my 1 million dollar mark. I feel like they will be able to do anything. Learning is half the battle and I love to learn new things to get ahead of the crowd. Now you get access to that as well. But don't tell anyone... we can keep that between us. This daily newsletter is gonna be an advanced course that people would pay thousands for all for free (maybe not... but my goal is let you live throug my struggles and successes so you can copy pasta them. Happy Weekend.</p>"
  },
  {
    "day": 8,
    "title": "My Million Dollar Plan: The Personal Brand Approach",
    "content": "<p>There is no one doing email marketing like I will do email marketing. Are there newsletters with millions of subcribers? Of course there are... but no one is doing a **\"personal brand\"** and trying to grow to 1 million subscribers in public.</p><p>So this is my plan. Build in Public but for new subscribers. My biggest problem right now isn't how to do it. It's what to focus on. Because let's be real. To Keep users interested most of the time you have to have something you always talk about or help them with. The obvious choice is being that newsletter person everyone talks about but sometimes that only get's so far. I need to think like James Clear. His newsletter is read by millions and it's a simple email. IT makes you think. Plus he has been doing it for a long time. So it makes sense.</p><p>See here is the thing... AI is gonna take over so much... that really all you have left is **being yourself.** So.... I'm building up my personal brand to make you fall in love with my writing. Sure I'll advertise here and there but most of the time we will just be talking.</p><p>That's step 1 of my master plan. Writing every single day \"should\" get me more people to read my stuff... one would hope. Then I take these newsletter issues and turn them into \"learning\" medium articles + reformat them for blog posts. This should help me with SEO and market shares I'm not 100% focused on but can bring in some good traffic in a year or two. Then the big one and my main focus for now - High quality threads or posts on Linked In, X, Threads. My only problem right now with them is... I don't know what to focus on... So I am testing the markets with different posts like this one or even this one. We can see what people love. so we keep building our audience. My theory is as I grow my following my subscribers will grow in this newsletter... but if you have ever done email marketing... you know the hardest part is getting someone to sign up to your email.</p><p>so let's keep moving. If you love this newsletter. make sure to forward this email to a friend!</p>"
  },
  {
    "day": 7,
    "title": "10.6% to a Habit: The Power of Consistency",
    "content": "<p>They say it takes 66 days to keep a habit. Which means I am 10.6% on my way to keeping it alive.</p><p>The crazy thing about doing this solo is my focus is 100%. I don't have any distractions when writing this. I can it down and budget 1 hour of my day writing this newsletter. No AI. Just me thinking and jotting down what I learned, thought about etc.</p><p>The point is. I am still doing it. 90% of people won't send their first 3 issues of a newsletter (they quit before they send them). That is mostly everything I have seen.</p><p>My plan is simple:</p><ul><li>Write this daily email.</li><li>Try to post daily on Medium.</li><li>Try to have 8-10 posts on Linked In, X , Threads.</li><li>Eventually build out the blogs SEO and do heavy pSEO work.</li></ul><p>That's it. That's the master plan of growing this newsletter. To 100k subscribers hopefully and 1 million in profits. Tomorrow I'll share exactly how I'm gonna do it all.</p>"
  },
  {
    "day": 6,
    "title": "The Big Break: Grinding vs. Luck (The Big Short)",
    "content": "<p>The Big Short is one of those movies that just makes you think. What other opportunities are there out there for you? Why I love it? Some people get lucky... Get a wrong number phone call. Win Big. So can't this be applied to anything? Work hard and you will get an opportunity.</p><p>Why am I saying this?</p><p>Well if you don't grow your solo business by reaching out to people, posting on socials, and just straight up grinding. You may never make it.</p><p>but.....</p><p>Doing the \"hard work\" isn't all you need most of the time to make it big. you need a big break. This can be anything... A post that goes viral. An influencer shouts you out.</p><p>The point is.. keep working towards that 1 million dollar goal. The longer you work towards it the better chance you get. So keep working towards it... **I know you got this.**</p><p>P.S. - if you are loving this newsletter... Please share this newsletter with a friend. Share the short for me :)</p>"
  },
  {
    "day": 5,
    "title": "How Side Hustles Got Me My 9-5 Job",
    "content": "<p>I finally got a job. It only took what feels like an eternity when you are broke. I was informed that I got the job yesterday... and the craziest part about it? I got it from my experience in my side hustles and solo adventure.</p><p>Now that mark my last two jobs were because of what I learned on the side intead of my main focus. Another reason to keep at this and go indie hacking / indie newsletter one day because I love it and I guess others love it as well.....</p><p>I don't start for another month so I have this entire month to focus on it + a few others things I'm working on. The good news is now instead of searching linked in for hours a day.... I can build out my plan again similar to how I was building , growing and monetizing my newsletter back then.</p><p>How would I do it? **Reddit.**</p><p>Reddit was a gold mine to simply plug my newsletter all over and wait for people to join. I even had a few viral post that made me hit 4k subs within about 2 months. Then I sold it! This is why I am back on newsletters. They take time to grow but once you get an audience they do very well!</p>"
  },
  {
    "day": 4,
    "title": "The True Value of Email Marketing (My $5k Story)",
    "content": "<p>Growing a newsletter is important. You should always have one, no matter what you are doing. Even YouTubers, I suggest, have emails.</p><p>But if you are building a SaaS/ have a local business / a social media following, you need to have people's emails.</p><p>Why? It's simple.</p><p>If you have someone email, two things happen.</p><ul><li>They are a true fan because people don't give up their emails.</li><li>If you lose all your stuff/sell it get banned etc. You still have the peoples emails.</li></ul><p>It's important to go all in on email marketing. Plus I have had my best results from email campaigns. My old product Niche Tools did over 5k in sales just from my newsletter alone.</p><p>Learn to story tell + sell and your 1 million dollar business will come faster than you think.... at least that's my hope. My plan to grow this newsletter to 1 million subscribers + 1 million dollars in revenue is kinda crazy but I love crazy and for the first time in 2 + years I am happy to do something. People are liking this writing so much they even asked me to ghost write for them... So I guess my calling after all was email?</p><p>Happy Monday. Let's make this a great week.</p>"
  },
  {
    "day": 3,
    "title": "Finding Customers: The Solopreneur's Cheat Code",
    "content": "<p>Find your customers At the end of the day everything is a sell. You are selling something. It can range from liking an Instagram photo of your family to selling a digital product to your email list. You are always doing something that involves a sale.</p><p>The hardest part isn't the sale.... It's finding the right customers. Yesterday, Justin Welsh published his weekly newsletter, which is a big inspiration to me. He has figured out this solo business model and he really understands how to market. You can read his entire issue here: Leverage is the solopreneur cheat code</p><p>In a nutshell he broke down exactly how you need to build an audience and I'm gonna steal some of his tactics to grow my followings over the next few months. He said this:</p><blockquote>\"But now I follow the 5-12-3 rule, which makes my life a heck of a lot easier. Every piece of content must work in 5 seconds (the hook grabs attention), remain relevant 12 months later (try your best for evergreen value), and function across at least three platforms (repurposing).\"</blockquote><p>So it got me thinking. I need to focus on this in my space and start producing high quality content I can share across all socials. **SO it's time to lock in** and grow my customer base (subscribers) to a level that most haven't seen. I have 3 new subscribers from yestreday and my content is starting to be seen by a bigger audience. I plan to keep growing this newsletter and as mentioned before this is my only focus.</p><p>Have a good Sunday & talk tomorrow.</p>"
  },
  {
    "day": 2,
    "title": "My Biggest Success: Niche Tools and the $50k Goal",
    "content": "<p>It's been a crazy 2 years since I joined the X community of indie hackers. I've built lots of stuff and had plenty of failures. But I've had quiet a few successes. Niche Tools, Build The Idea, Under2k, to name a few. All of which did well for me.</p><p>The best one ? Niche Tools. Did over 50k in total sales. I also sold it and bought it back (a story for another day).</p><p>Why am I saying all this? Simple. This newsletter's goal is to generate 50k in revenue in one year. We are only on day 2. So we got a long way to go. I also don't want to sell sponsorships and want to keep this personal. We will see how I sprinkle in some of these ideas. I wanna work on my storytelling. It's an art form that I'd love to master. Keeping you reading to the very last line. I know how quickly I move on the next thing.</p><p>So what is the goal of this newsletter? It's simple. **Improve everyday & build it into a 1 million dollar business.** How? Not sure but I'm ready to try. so we keep writing and we will see what it brings me.</p><p>Until tomorrow!</p>"
  },
  {
    "day": 1,
    "title": "The Last Topic Swap: 365 Days of Writing",
    "content": "<p>I promise this is the last time I'm swapping topics! Look if you have followed me you know I go from one thing to another. The crazy thing is I always wanted to stick to one thing and one thing only for a year.</p><p>I've had plenty of people tell me I need to and show people about different ways I talk and write and just really be myself. Talk about what I want on X, post what I want on here and just not worry about the money and fame.</p><p>So here's the deal. Today is Isssue #1. I am going to write for the next 365 days about anything I want. I'll focus on what I'm interested on like finance news, crypto, ideas, side hustles etc but sometimes I may talk about how my kids were horrible and what I looked up as a dad. The point is, I'm just gonna write everyday and see what happens. I'll also post it to medium and see the type of following I grow just talking about my thoughts.</p><p>I hope you follow me on the journey. See you tomorrow with topic #1 Share this with a friend because this is gonna get juicy. Oh I'm gonna be transparent also. So today we have 32 subscribers. Let's document it all.</p>"
  }
]